doc/intro-to-s-sql.org
#+TITLE: Intro to S-SQL
#+OPTIONS: num:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style.css" />
#+HTML_HEAD: <style>pre.src{background:#343131;color:white;} </style>
#+OPTIONS: ^:nil

| [[file:s-sql-a.org][A]]| [[file:s-sql-b.org][B]]| [[file:s-sql-c.org][C]]| [[file:s-sql-d.org][D]]| [[file:s-sql-e.org][E]]| [[file:s-sql-f.org][F]]| [[file:s-sql-g.org][G]]| [[file:s-sql-h.org][H]]| [[file:s-sql-i.org][I]]| [[file:s-sql-j.org][J]]| [[file:s-sql-k.org][K]]| [[file:s-sql-l.org][L]]| [[file:s-sql-m.org][M]]| [[file:s-sql-n.org][N]]| [[file:s-sql-o.org][O]]| [[file:s-sql-p.org][P]]| [[file:s-sql-r.org][R]]| [[file:s-sql-s.org][S]]| [[file:s-sql-t.org][T]]| [[file:s-sql-u.org][U]]| [[file:s-sql-v.org][V]]| [[file:s-sql-w.org][W]]|  [[file:s-sql-special-characters.org][Special Characters]]                        |  [[file:calling-postgresql-stored-functions.org][Calling Postgresql Stored Functions and Procedures]]|

* Intro to S-SQL
  :PROPERTIES:
  :CUSTOM_ID: intro
  :END:
Postmodern can use any sql string in a query. It also has its own lispy syntax called s-sql. Various examples using postmodern will be given in both standard sql and s-sql. Note that not all of sql has been implemented in the s-sql syntax. Postmodern is fully capable of handling any sql string. It just looks a little ugly once you get used to looking at lisp type syntax.

Consider the following database calls and the return. Note that all query functions are postmodern functions, after this next example, I'm going to shorten the function call and drop the "postmodern:".
#+begin_src lisp
  (postmodern:query "select id, name from countries where name=$1" "Vietnam")

  ((68 "Vietnam"))

#+end_src

This can be rephrased in s-sql as:
#+begin_src lisp
(query (:select 'id 'name
                :from 'countries
                :where (:= 'name '$1))

        "Vietnam")

#+end_src

You will notice that the commas have dropped out, columns and table names are inital-quoted and the sql operators have colons in from. It does look more "lispy" doesn't it?

It can be handy to note that replacing "query" with "sql" returns the sql statement rather than trying to execute the query. This can be helpful in designing s-sql queries. Thus:
#+begin_src lisp
(sql (:select 'countries.name 'regions.name :distinct
              :from 'regions 'countries
              :where (:= 'regions.id 'countries.region_id)))

 "(SELECT DISTINCT countries.name, regions.name FROM regions, countries WHERE (regions.id = countries.region_id))"

#+end_src

* Sql-escape, Sql-escape-string
  :PROPERTIES:
  :CUSTOM_ID: sql-escape
  :END:
Does what it says on the tin. It escapes a string so that you can safely include the string in an sql query.
#+begin_src lisp
(let ((x "\#udlsh29c#^"))
   (sql-escape x))

"E'#udlsh29c#^'"

(sql-escape-string "\#udlsh29c#^")

"E'#udlsh29c#^'"

#+end_src

* Sql-compile
  :PROPERTIES:
  :CUSTOM_ID: sql-compile
  :END:

sql-compile is the run-time version of the sql macro, which means that it converts a list into an sql query. See the following as an example. Note carefully the backquotes and commas.
#+begin_src lisp
(defun create-table1 (table-name-string &rest rest)
  "Each of the parameters after the table-name must be in the form ofa two parameter list - the column name as a string and the type as a symbol. See the following as an example"
  (query (postmodern:sql-compile
          `(:create-table ,table-name-string ,(loop for y in rest collect
                                                    (list (first y)
                                                          :type (second y)))))))

(create-table1 "test25" (list "name" 'string) (list "address" 'string))

#+end_src

You also can see how it is used in the following queries handling some insertions and updates in which plists were providing the source of columns and values.
#+begin_src lisp
  (query
   (sql-compile
    (append `(:insert-into ,table :set) plst)))

  (query
   (sql-compile
    (append (append `(:update ,table :set)
                    plst)
            `(:where (:= 'id ,id)))))

#+end_src


Remember, if you are using sql-compile or any other method to create dynamic queries, you are responsible for ensuring the security. All user input should be sanitized.
