doc/intro-to-s-sql.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-12-12 Tue 18:30 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Intro to S-SQL</title>
<meta name="author" content="Sabra Crolleton" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">Intro to S-SQL</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#intro">Intro to S-SQL</a></li>
<li><a href="#sql-escape">Sql-escape, Sql-escape-string</a></li>
<li><a href="#sql-compile">Sql-compile</a></li>
<li><a href="#return-types">Return Types</a>
<ul>
<li><a href="#return-type-none">:none</a></li>
<li><a href="#return-type-lists">:lists</a></li>
<li><a href="#return-type-rows">:rows</a></li>
<li><a href="#return-type-alist">:alist</a></li>
<li><a href="#return-type-str-alist">:str-alist</a></li>
<li><a href="#return-type-alists">:alists</a></li>
<li><a href="#return-type-str-alists">:str-alists</a></li>
<li><a href="#return-type-plist">:plist</a></li>
<li><a href="#return-type-plists">:plists</a></li>
<li><a href="#return-type-array-hash">:array-hash</a></li>
<li><a href="#return-type-single">:single</a></li>
<li><a href="#return-type-single-bang">:single!</a></li>
<li><a href="#org6ff4f48">:column</a></li>
<li><a href="#org96aa55e">:vectors</a></li>
<li><a href="#return-type-dao-type">(:dao dao-type)</a></li>
<li><a href="#return-type-dao-type-single">(:dao dao-type :single)</a></li>
<li><a href="#org15278fc">Json-strs</a></li>
<li><a href="#orgf4eb7f0">Json-str</a></li>
<li><a href="#org03deb44">Json-array-str</a></li>
</ul>
</li>
<li><a href="#alias">As or Alias</a>
<ul>
<li><a href="#concatenate">:|| Concatenating Columns</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="s-sql-a.html">A</a></td>
<td class="org-left"><a href="s-sql-b.html">B</a></td>
<td class="org-left"><a href="s-sql-c.html">C</a></td>
<td class="org-left"><a href="s-sql-d.html">D</a></td>
<td class="org-left"><a href="s-sql-e.html">E</a></td>
<td class="org-left"><a href="s-sql-f.html">F</a></td>
<td class="org-left"><a href="s-sql-g.html">G</a></td>
<td class="org-left"><a href="s-sql-h.html">H</a></td>
<td class="org-left"><a href="s-sql-i.html">I</a></td>
<td class="org-left"><a href="s-sql-j.html">J</a></td>
<td class="org-left"><a href="s-sql-k.html">K</a></td>
<td class="org-left"><a href="s-sql-l.html">L</a></td>
<td class="org-left"><a href="s-sql-m.html">M</a></td>
<td class="org-left"><a href="s-sql-n.html">N</a></td>
<td class="org-left"><a href="s-sql-o.html">O</a></td>
<td class="org-left"><a href="s-sql-p.html">P</a></td>
<td class="org-left"><a href="s-sql-r.html">R</a></td>
<td class="org-left"><a href="s-sql-s.html">S</a></td>
<td class="org-left"><a href="s-sql-t.html">T</a></td>
<td class="org-left"><a href="s-sql-u.html">U</a></td>
<td class="org-left"><a href="s-sql-v.html">V</a></td>
<td class="org-left"><a href="s-sql-w.html">W</a></td>
<td class="org-left"><a href="s-sql-special-characters.html">Special Characters</a></td>
<td class="org-left"><a href="calling-postgresql-stored-functions.html">Calling Postgresql Stored Functions and Procedures</a></td>
</tr>
</tbody>
</table>

<div id="outline-container-intro" class="outline-2">
<h2 id="intro">Intro to S-SQL</h2>
<div class="outline-text-2" id="text-intro">
<p>
Postmodern can use any sql string in a query. It also has its own lispy syntax called s-sql. Various examples using postmodern will be given in both standard sql and s-sql. Note that not all of sql has been implemented in the s-sql syntax. Postmodern is fully capable of handling any sql string. It just looks a little ugly once you get used to looking at lisp type syntax.
</p>

<p>
Consider the following database calls and the return. Note that all query functions are postmodern functions, after this next example, I'm going to shorten the function call and drop the "postmodern:".
</p>
<div class="org-src-container">
<pre class="src src-lisp">(postmodern:query <span class="org-string">"select id, name from countries where name=$1"</span> <span class="org-string">"Vietnam"</span>)

((68 <span class="org-string">"Vietnam"</span>))

</pre>
</div>

<p>
This can be rephrased in s-sql as:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'id 'name
                <span class="org-builtin">:from</span> 'countries
                <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'name '$1))

        <span class="org-string">"Vietnam"</span>)

</pre>
</div>

<p>
You will notice that the commas have dropped out, columns and table names are inital-quoted and the sql operators have colons in from. It does look more "lispy" doesn't it?
</p>

<p>
It can be handy to note that replacing "query" with "sql" returns the sql statement rather than trying to execute the query. This can be helpful in designing s-sql queries. Thus:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(sql (<span class="org-builtin">:select</span> 'countries.name 'regions.name <span class="org-builtin">:distinct</span>
              <span class="org-builtin">:from</span> 'regions 'countries
              <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'regions.id 'countries.region_id)))

 <span class="org-string">"(SELECT DISTINCT countries.name, regions.name FROM regions, countries WHERE (regions.id = countries.region_id))"</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-sql-escape" class="outline-2">
<h2 id="sql-escape">Sql-escape, Sql-escape-string</h2>
<div class="outline-text-2" id="text-sql-escape">
<p>
Does what it says on the tin. It escapes a string so that you can safely include the string in an sql query.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">let</span> ((x <span class="org-string">"\#udlsh29c#^"</span>))
   (sql-escape x))

<span class="org-string">"E'#udlsh29c#^'"</span>

(sql-escape-string <span class="org-string">"\#udlsh29c#^"</span>)

<span class="org-string">"E'#udlsh29c#^'"</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-sql-compile" class="outline-2">
<h2 id="sql-compile">Sql-compile</h2>
<div class="outline-text-2" id="text-sql-compile">
<p>
sql-compile is the run-time version of the sql macro, which means that it converts a list into an sql query. See the following as an example. Note carefully the backquotes and commas.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">create-table1</span> (table-name-string <span class="org-type">&amp;rest</span> rest)
  <span class="org-doc">"Each of the parameters after the table-name must be in the form ofa two parameter list - the column name as a string and the type as a symbol. See the following as an example"</span>
  (query (postmodern:sql-compile
          `(<span class="org-builtin">:create-table</span> ,table-name-string ,(<span class="org-keyword">loop</span> for y in rest collect
                                                    (list (first y)
                                                          <span class="org-builtin">:type</span> (second y)))))))

(create-table1 <span class="org-string">"test25"</span> (list <span class="org-string">"name"</span> 'string) (list <span class="org-string">"address"</span> 'string))

</pre>
</div>

<p>
You also can see how it is used in the following queries handling some insertions and updates in which plists were providing the source of columns and values.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query
 (sql-compile
  (append `(<span class="org-builtin">:insert-into</span> ,table <span class="org-builtin">:set</span>) plst)))

(query
 (sql-compile
  (append (append `(<span class="org-builtin">:update</span> ,table <span class="org-builtin">:set</span>)
                  plst)
          `(<span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'id ,id)))))

</pre>
</div>


<p>
Remember, if you are using sql-compile or any other method to create dynamic queries, you are responsible for ensuring the security. All user input should be sanitized.
</p>
</div>
</div>
