doc/intro-to-s-sql.org
* Return Types
  :PROPERTIES:
  :CUSTOM_ID: return-types
  :END:
You can give postmodern various directions, using keywords, for way that values get returned. Some of these keywords will be used in various examples to follow.


| :none	             | Ignore the result values.                                                                                                                                |
| :lists, :rows       | 	Return a list of lists, each list containing the values for a row.                                                                                     |
| :list, :row         | 	Return a single row as a list.                                                                                                                         |
| :alists	           | Return a list of alists which map column names to values, with the names represented as keywords.                                                        |
| :alist	            | Return a single row as an alist.                                                                                                                         |
| :str-alists         | 	Like :alists, but use the original column names.                                                                                                       |
| :str-alist	        | Return a single row as an alist, with strings for names.                                                                                                 |
| :plists	           | Return a list of plists which map column names to values,with the names represented as keywords.                                                         |
| :plist	            | Return a single row as a plist.                                                          |
| :column	           | Return a single column as a list.                 |
| :single	           | Return a single value. Will raise an error if the query returns more than one field. If the query returns more than one row, it returns the first row. |
| :single!	          | Like :single except that it will throw an error when the number of selected rows is not equal to 1.  |
| :vectors	    | Return a vector of vectors, each vector containing the values for a row. (This is only the plural) |
| :array-hash         | Return an array of hashtables which map column names to hash table keys     |
| :json-strs          | Return a list of strings where each row is a json object expressed as a string  |
| :json-str           | Return a single string where the row returned is a json object expressed as a string           |
| :json-array-str     | Return a string containing a json array, each element in the array is a selected row expressed as a json object |
| (:dao type)	       | Return a list of DAOs of the given type. The names of the fields returned by the query must match slots in the DAO class the same way as with query-dao. |
| (:dao type :single) | 	Return a single DAO of the given type. |

Consider the following database calls, written in s-sql and the return, noting how the ending keywords affect the type of return:
#+begin_src lisp
  (query (:select 'name
          :from 'countries
          :where (:> 'latitude '$1))
         60)

  (("Faroe Islands") ("Finland") ("Greenland") ("Iceland") ("Norway") ("Sweden"))

#+end_src

** :none
  :PROPERTIES:
  :CUSTOM_ID: return-type-none
  :END:
#+begin_src lisp
(query (:select 'name
                :from 'countries
                :where (:> 'latitude '$1))
       60 :none)

NIL
#+end_src

** :lists
  :PROPERTIES:
  :CUSTOM_ID: return-type-lists
  :END:
  Return a list of lists, each list containing the values for a row.
#+begin_src lisp
(query (:select 'name
                :from 'countries
                :where (:> 'latitude '$1))
       60 :lists)

(("Faroe Islands") ("Iceland") ("Greenland") ("Sweden") ("Norway") ("Finland"))

#+end_src

** :rows
  :PROPERTIES:
  :CUSTOM_ID: return-type-rows
  :END:
  Same as lists - Return a list of lists, each list containing the values for a row.
#+begin_src lisp
  (query (:select 'name
                  :from 'countries
                  :where (:> 'latitude '$1))
         60 :rows)

  (("Faroe Islands") ("Iceland") ("Greenland") ("Sweden") ("Norway") ("Finland"))

#+end_src

** :alist
  :PROPERTIES:
  :CUSTOM_ID: return-type-alist
  :END:
#+begin_src lisp
  (query (:select 'name
                  :from 'countries
                  :where (:> 'latitude '$1))
         60 :alist)

  ((:NAME . "Faroe Islands"))
#+end_src


** :str-alist
  :PROPERTIES:
  :CUSTOM_ID: return-type-str-alist
  :END:
#+begin_src lisp
(query (:select 'name
                :from 'countries
                :where (:> 'latitude '$1))
       60 :str-alist)

(("name" . "Faroe Islands"))

#+end_src

** :alists
  :PROPERTIES:
  :CUSTOM_ID: return-type-alists
  :END:
#+begin_src lisp
(query (:select 'name
                :from 'countries
                :where (:> 'latitude '$1))
       60 :alists)

(((:NAME . "Faroe Islands")) ((:NAME . "Finland")) ((:NAME . "Greenland"))  ((:NAME . "Iceland")) ((:NAME . "Norway")) ((:NAME . "Sweden")))

#+end_src

** :str-alists
  :PROPERTIES:
  :CUSTOM_ID: return-type-str-alists
  :END:
#+begin_src lisp
(query (:select 'name
                :from 'countries
                :where (:> 'latitude '$1))
       60 :str-alists)

((("name" . "Faroe Islands")) (("name" . "Finland")) (("name" . "Greenland"))  (("name" . "Iceland")) (("name" . "Norway")) (("name" . "Sweden")))

#+end_src

** :plist
  :PROPERTIES:
  :CUSTOM_ID: return-type-plist
  :END:
#+begin_src lisp
(query (:select 'name
                :from 'countries
                :where (:> 'latitude '$1))
       60 :plist)

(:NAME "Faroe Islands")

#+end_src

