doc/intro-to-s-sql.html
<div id="outline-container-return-types" class="outline-2">
<h2 id="return-types">Return Types</h2>
<div class="outline-text-2" id="text-return-types">
<p>
You can give postmodern various directions, using keywords, for way that values get returned. Some of these keywords will be used in various examples to follow.
</p>


<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">:none</td>
<td class="org-left">Ignore the result values.</td>
</tr>

<tr>
<td class="org-left">:lists, :rows</td>
<td class="org-left">Return a list of lists, each list containing the values for a row.</td>
</tr>

<tr>
<td class="org-left">:list, :row</td>
<td class="org-left">Return a single row as a list.</td>
</tr>

<tr>
<td class="org-left">:alists</td>
<td class="org-left">Return a list of alists which map column names to values, with the names represented as keywords.</td>
</tr>

<tr>
<td class="org-left">:alist</td>
<td class="org-left">Return a single row as an alist.</td>
</tr>

<tr>
<td class="org-left">:str-alists</td>
<td class="org-left">Like :alists, but use the original column names.</td>
</tr>

<tr>
<td class="org-left">:str-alist</td>
<td class="org-left">Return a single row as an alist, with strings for names.</td>
</tr>

<tr>
<td class="org-left">:plists</td>
<td class="org-left">Return a list of plists which map column names to values,with the names represented as keywords.</td>
</tr>

<tr>
<td class="org-left">:plist</td>
<td class="org-left">Return a single row as a plist.</td>
</tr>

<tr>
<td class="org-left">:column</td>
<td class="org-left">Return a single column as a list.</td>
</tr>

<tr>
<td class="org-left">:single</td>
<td class="org-left">Return a single value. Will raise an error if the query returns more than one field. If the query returns more than one row, it returns the first row.</td>
</tr>

<tr>
<td class="org-left">:single!</td>
<td class="org-left">Like :single except that it will throw an error when the number of selected rows is not equal to 1.</td>
</tr>

<tr>
<td class="org-left">:vectors</td>
<td class="org-left">Return a vector of vectors, each vector containing the values for a row. (This is only the plural)</td>
</tr>

<tr>
<td class="org-left">:array-hash</td>
<td class="org-left">Return an array of hashtables which map column names to hash table keys</td>
</tr>

<tr>
<td class="org-left">:json-strs</td>
<td class="org-left">Return a list of strings where each row is a json object expressed as a string</td>
</tr>

<tr>
<td class="org-left">:json-str</td>
<td class="org-left">Return a single string where the row returned is a json object expressed as a string</td>
</tr>

<tr>
<td class="org-left">:json-array-str</td>
<td class="org-left">Return a string containing a json array, each element in the array is a selected row expressed as a json object</td>
</tr>

<tr>
<td class="org-left">(:dao type)</td>
<td class="org-left">Return a list of DAOs of the given type. The names of the fields returned by the query must match slots in the DAO class the same way as with query-dao.</td>
</tr>

<tr>
<td class="org-left">(:dao type :single)</td>
<td class="org-left">Return a single DAO of the given type.</td>
</tr>
</tbody>
</table>

<p>
Consider the following database calls, written in s-sql and the return, noting how the ending keywords affect the type of return:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'name
        <span class="org-builtin">:from</span> 'countries
        <span class="org-builtin">:where</span> (<span class="org-builtin">:&gt;</span> 'latitude '$1))
       60)

((<span class="org-string">"Faroe Islands"</span>) (<span class="org-string">"Finland"</span>) (<span class="org-string">"Greenland"</span>) (<span class="org-string">"Iceland"</span>) (<span class="org-string">"Norway"</span>) (<span class="org-string">"Sweden"</span>))

</pre>
</div>
</div>

<div id="outline-container-return-type-none" class="outline-3">
<h3 id="return-type-none">:none</h3>
<div class="outline-text-3" id="text-return-type-none">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'name
                <span class="org-builtin">:from</span> 'countries
                <span class="org-builtin">:where</span> (<span class="org-builtin">:&gt;</span> 'latitude '$1))
       60 <span class="org-builtin">:none</span>)

NIL
</pre>
</div>
</div>
</div>

<div id="outline-container-return-type-lists" class="outline-3">
<h3 id="return-type-lists">:lists</h3>
<div class="outline-text-3" id="text-return-type-lists">
<p>
Return a list of lists, each list containing the values for a row.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'name
                <span class="org-builtin">:from</span> 'countries
                <span class="org-builtin">:where</span> (<span class="org-builtin">:&gt;</span> 'latitude '$1))
       60 <span class="org-builtin">:lists</span>)

((<span class="org-string">"Faroe Islands"</span>) (<span class="org-string">"Iceland"</span>) (<span class="org-string">"Greenland"</span>) (<span class="org-string">"Sweden"</span>) (<span class="org-string">"Norway"</span>) (<span class="org-string">"Finland"</span>))

</pre>
</div>
</div>
</div>

<div id="outline-container-return-type-rows" class="outline-3">
<h3 id="return-type-rows">:rows</h3>
<div class="outline-text-3" id="text-return-type-rows">
<p>
Same as lists - Return a list of lists, each list containing the values for a row.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'name
                <span class="org-builtin">:from</span> 'countries
                <span class="org-builtin">:where</span> (<span class="org-builtin">:&gt;</span> 'latitude '$1))
       60 <span class="org-builtin">:rows</span>)

((<span class="org-string">"Faroe Islands"</span>) (<span class="org-string">"Iceland"</span>) (<span class="org-string">"Greenland"</span>) (<span class="org-string">"Sweden"</span>) (<span class="org-string">"Norway"</span>) (<span class="org-string">"Finland"</span>))

</pre>
</div>
</div>
</div>
