doc/intro-to-s-sql.org
** :plists
  :PROPERTIES:
  :CUSTOM_ID: return-type-plists
  :END:
#+begin_src lisp
(query (:select 'name
                :from 'countries
                :where (:> 'latitude '$1))
       60 :plists)

((:NAME "Faroe Islands") (:NAME "Iceland") (:NAME "Greenland")  (:NAME "Sweden") (:NAME "Norway") (:NAME "Finland"))

#+end_src

** :array-hash
  :PROPERTIES:
  :CUSTOM_ID: return-type-array-hash
  :END:
#+begin_src lisp
(query (:select 'name
                :from 'countries
                :where (:> 'latitude '$1))
       60 :array-hash)

#(#<HASH-TABLE :TEST EQUAL :COUNT 1 {1005DFB5A3}>   #<HASH-TABLE :TEST EQUAL :COUNT 1 {1005DFBB63}>   #<HASH-TABLE :TEST EQUAL :COUNT 1 {1005DFC123}>   #<HASH-TABLE :TEST EQUAL :COUNT 1 {1005DFC6E3}>   #<HASH-TABLE :TEST EQUAL :COUNT 1 {1005DFCCA3}>   #<HASH-TABLE :TEST EQUAL :COUNT 1 {1005DFD263}>   #<HASH-TABLE :TEST EQUAL :COUNT 1 {1005DFD823}>   #<HASH-TABLE :TEST EQUAL :COUNT 1 {1005DFDDE3}>   #<HASH-TABLE :TEST EQUAL :COUNT 1 {1005DFE3A3}>)

#+end_src

** :single
  :PROPERTIES:
  :CUSTOM_ID: return-type-single
  :END:
  Returns a single value. Will raise an error if the query returns more than one field. If the query returns more than one row, it returns the first row.
#+begin_src lisp
(query (:select 'name
                :from 'countries
                :where (:> 'latitude '$1))
       60 :single)

"Faroe Islands"

#+end_src

** :single!
  :PROPERTIES:
  :CUSTOM_ID: return-type-single-bang
  :END:
  Like :single except that it will throw an error when the number of selected rows is not equal to 1.
#+begin_src lisp
(query (:select 'name
                :from 'countries
                :where (:> 'latitude '$1))
       60 :single!)

; Evaluation aborted on #<CL-POSTGRES:DATABASE-ERROR {100E83B813}>. LISP-TAX-TEST> Database error: Query for a single row returned 6 rows.    [Condition of type DATABASE-ERROR]

#+end_src

** :column
  :PROPERTIES:
  :CUSTOM_ID: return-type-column
  :END
  Returns a single column as a list. The first example shows the default value returned without the :column qualifier. The second example shows the result with the column qualifier. :
#+begin_src lisp
(query (:select 'name

                :from 'countries

                :where (:> 'latitude '$1))

       60 :column)

("Faroe Islands" "Finland" "Greenland" "Iceland" "Norway" "Sweden")
#+end_src
** :vectors
  :PROPERTIES:
  :CUSTOM_ID: return-type-vector
  :END
  #+begin_src lisp
    (query (:select 'id 'int4 'text :from 'test-data)
           :vectors)
    #(#(1 2147483645 "text one")
      #(2 0 "text two")
      #(3 3 "text three"))

    (query (:select 'id 'int4 'text :from 'test-data :where (:< 'id 1))
           :vectors)
    #()
  #+end_src
** (:dao dao-type)
  :PROPERTIES:
  :CUSTOM_ID: return-type-dao-type
  :END:
This assumes you have already created a class for this table.
#+begin_src lisp
  (query (:select '* :from 'countries)
         (:dao country))

  (#<COUNTRY {1004F1BAF3}> #<COUNTRY {1004F1BD73}> #<COUNTRY {1004F1BFF3}>)

#+end_src

** (:dao dao-type :single)
  :PROPERTIES:
  :CUSTOM_ID: return-type-dao-type-single
  :END:
#+begin_src lisp
(query (:select '* :from 'countries :where (:= 'name "Iceland")
       (:dao country))

#<COUNTRY {1004F1BAF3}>

#+end_src

