doc/intro-to-s-sql.html

<div id="outline-container-return-type-alist" class="outline-3">
<h3 id="return-type-alist">:alist</h3>
<div class="outline-text-3" id="text-return-type-alist">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'name
                <span class="org-builtin">:from</span> 'countries
                <span class="org-builtin">:where</span> (<span class="org-builtin">:&gt;</span> 'latitude '$1))
       60 <span class="org-builtin">:alist</span>)

((<span class="org-builtin">:NAME</span> . <span class="org-string">"Faroe Islands"</span>))
</pre>
</div>
</div>
</div>


<div id="outline-container-return-type-str-alist" class="outline-3">
<h3 id="return-type-str-alist">:str-alist</h3>
<div class="outline-text-3" id="text-return-type-str-alist">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'name
                <span class="org-builtin">:from</span> 'countries
                <span class="org-builtin">:where</span> (<span class="org-builtin">:&gt;</span> 'latitude '$1))
       60 <span class="org-builtin">:str-alist</span>)

((<span class="org-string">"name"</span> . <span class="org-string">"Faroe Islands"</span>))

</pre>
</div>
</div>
</div>

<div id="outline-container-return-type-alists" class="outline-3">
<h3 id="return-type-alists">:alists</h3>
<div class="outline-text-3" id="text-return-type-alists">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'name
                <span class="org-builtin">:from</span> 'countries
                <span class="org-builtin">:where</span> (<span class="org-builtin">:&gt;</span> 'latitude '$1))
       60 <span class="org-builtin">:alists</span>)

(((<span class="org-builtin">:NAME</span> . <span class="org-string">"Faroe Islands"</span>)) ((<span class="org-builtin">:NAME</span> . <span class="org-string">"Finland"</span>)) ((<span class="org-builtin">:NAME</span> . <span class="org-string">"Greenland"</span>))  ((<span class="org-builtin">:NAME</span> . <span class="org-string">"Iceland"</span>)) ((<span class="org-builtin">:NAME</span> . <span class="org-string">"Norway"</span>)) ((<span class="org-builtin">:NAME</span> . <span class="org-string">"Sweden"</span>)))

</pre>
</div>
</div>
</div>

<div id="outline-container-return-type-str-alists" class="outline-3">
<h3 id="return-type-str-alists">:str-alists</h3>
<div class="outline-text-3" id="text-return-type-str-alists">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'name
                <span class="org-builtin">:from</span> 'countries
                <span class="org-builtin">:where</span> (<span class="org-builtin">:&gt;</span> 'latitude '$1))
       60 <span class="org-builtin">:str-alists</span>)

(((<span class="org-string">"name"</span> . <span class="org-string">"Faroe Islands"</span>)) ((<span class="org-string">"name"</span> . <span class="org-string">"Finland"</span>)) ((<span class="org-string">"name"</span> . <span class="org-string">"Greenland"</span>))  ((<span class="org-string">"name"</span> . <span class="org-string">"Iceland"</span>)) ((<span class="org-string">"name"</span> . <span class="org-string">"Norway"</span>)) ((<span class="org-string">"name"</span> . <span class="org-string">"Sweden"</span>)))

</pre>
</div>
</div>
</div>

<div id="outline-container-return-type-plist" class="outline-3">
<h3 id="return-type-plist">:plist</h3>
<div class="outline-text-3" id="text-return-type-plist">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'name
                <span class="org-builtin">:from</span> 'countries
                <span class="org-builtin">:where</span> (<span class="org-builtin">:&gt;</span> 'latitude '$1))
       60 <span class="org-builtin">:plist</span>)

(<span class="org-builtin">:NAME</span> <span class="org-string">"Faroe Islands"</span>)

</pre>
</div>
</div>
</div>

<div id="outline-container-return-type-plists" class="outline-3">
<h3 id="return-type-plists">:plists</h3>
<div class="outline-text-3" id="text-return-type-plists">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'name
                <span class="org-builtin">:from</span> 'countries
                <span class="org-builtin">:where</span> (<span class="org-builtin">:&gt;</span> 'latitude '$1))
       60 <span class="org-builtin">:plists</span>)

((<span class="org-builtin">:NAME</span> <span class="org-string">"Faroe Islands"</span>) (<span class="org-builtin">:NAME</span> <span class="org-string">"Iceland"</span>) (<span class="org-builtin">:NAME</span> <span class="org-string">"Greenland"</span>)  (<span class="org-builtin">:NAME</span> <span class="org-string">"Sweden"</span>) (<span class="org-builtin">:NAME</span> <span class="org-string">"Norway"</span>) (<span class="org-builtin">:NAME</span> <span class="org-string">"Finland"</span>))

</pre>
</div>
</div>
</div>

<div id="outline-container-return-type-array-hash" class="outline-3">
<h3 id="return-type-array-hash">:array-hash</h3>
<div class="outline-text-3" id="text-return-type-array-hash">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'name
                <span class="org-builtin">:from</span> 'countries
                <span class="org-builtin">:where</span> (<span class="org-builtin">:&gt;</span> 'latitude '$1))
       60 <span class="org-builtin">:array-hash</span>)

#(#&lt;HASH-TABLE <span class="org-builtin">:TEST</span> EQUAL <span class="org-builtin">:COUNT</span> 1 {1005DFB5A3}&gt;   #&lt;HASH-TABLE <span class="org-builtin">:TEST</span> EQUAL <span class="org-builtin">:COUNT</span> 1 {1005DFBB63}&gt;   #&lt;HASH-TABLE <span class="org-builtin">:TEST</span> EQUAL <span class="org-builtin">:COUNT</span> 1 {1005DFC123}&gt;   #&lt;HASH-TABLE <span class="org-builtin">:TEST</span> EQUAL <span class="org-builtin">:COUNT</span> 1 {1005DFC6E3}&gt;   #&lt;HASH-TABLE <span class="org-builtin">:TEST</span> EQUAL <span class="org-builtin">:COUNT</span> 1 {1005DFCCA3}&gt;   #&lt;HASH-TABLE <span class="org-builtin">:TEST</span> EQUAL <span class="org-builtin">:COUNT</span> 1 {1005DFD263}&gt;   #&lt;HASH-TABLE <span class="org-builtin">:TEST</span> EQUAL <span class="org-builtin">:COUNT</span> 1 {1005DFD823}&gt;   #&lt;HASH-TABLE <span class="org-builtin">:TEST</span> EQUAL <span class="org-builtin">:COUNT</span> 1 {1005DFDDE3}&gt;   #&lt;HASH-TABLE <span class="org-builtin">:TEST</span> EQUAL <span class="org-builtin">:COUNT</span> 1 {1005DFE3A3}&gt;)

</pre>
</div>
</div>
</div>

<div id="outline-container-return-type-single" class="outline-3">
<h3 id="return-type-single">:single</h3>
<div class="outline-text-3" id="text-return-type-single">
<p>
Returns a single value. Will raise an error if the query returns more than one field. If the query returns more than one row, it returns the first row.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'name
                <span class="org-builtin">:from</span> 'countries
                <span class="org-builtin">:where</span> (<span class="org-builtin">:&gt;</span> 'latitude '$1))
       60 <span class="org-builtin">:single</span>)

<span class="org-string">"Faroe Islands"</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-return-type-single-bang" class="outline-3">
<h3 id="return-type-single-bang">:single!</h3>
<div class="outline-text-3" id="text-return-type-single-bang">
<p>
Like :single except that it will throw an error when the number of selected rows is not equal to 1.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'name
                <span class="org-builtin">:from</span> 'countries
                <span class="org-builtin">:where</span> (<span class="org-builtin">:&gt;</span> 'latitude '$1))
       60 <span class="org-builtin">:single!</span>)

<span class="org-comment-delimiter">; </span><span class="org-comment">Evaluation aborted on #&lt;CL-POSTGRES:DATABASE-ERROR {100E83B813}&gt;. LISP-TAX-TEST&gt; Database error: Query for a single row returned 6 rows.    [Condition of type DATABASE-ERROR]</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org6ff4f48" class="outline-3">
<h3 id="org6ff4f48">:column</h3>
<div class="outline-text-3" id="text-org6ff4f48">
<p>
:PROPERTIES:
:CUSTOM_ID: return-type-column
:END
Returns a single column as a list. The first example shows the default value returned without the :column qualifier. The second example shows the result with the column qualifier. :
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'name

                <span class="org-builtin">:from</span> 'countries

                <span class="org-builtin">:where</span> (<span class="org-builtin">:&gt;</span> 'latitude '$1))

       60 <span class="org-builtin">:column</span>)

(<span class="org-string">"Faroe Islands"</span> <span class="org-string">"Finland"</span> <span class="org-string">"Greenland"</span> <span class="org-string">"Iceland"</span> <span class="org-string">"Norway"</span> <span class="org-string">"Sweden"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org96aa55e" class="outline-3">
<h3 id="org96aa55e">:vectors</h3>
<div class="outline-text-3" id="text-org96aa55e">
<p>
:PROPERTIES:
:CUSTOM_ID: return-type-vector
:END
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'id 'int4 'text <span class="org-builtin">:from</span> 'test-data)
       <span class="org-builtin">:vectors</span>)
#(#(1 2147483645 <span class="org-string">"text one"</span>)
  #(2 0 <span class="org-string">"text two"</span>)
  #(3 3 <span class="org-string">"text three"</span>))

(query (<span class="org-builtin">:select</span> 'id 'int4 'text <span class="org-builtin">:from</span> 'test-data <span class="org-builtin">:where</span> (<span class="org-builtin">:&lt;</span> 'id 1))
       <span class="org-builtin">:vectors</span>)
#()
</pre>
</div>
</div>
</div>
<div id="outline-container-return-type-dao-type" class="outline-3">
<h3 id="return-type-dao-type">(:dao dao-type)</h3>
<div class="outline-text-3" id="text-return-type-dao-type">
<p>
This assumes you have already created a class for this table.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> '* <span class="org-builtin">:from</span> 'countries)
       (<span class="org-builtin">:dao</span> country))

(#&lt;COUNTRY {1004F1BAF3}&gt; #&lt;COUNTRY {1004F1BD73}&gt; #&lt;COUNTRY {1004F1BFF3}&gt;)

</pre>
</div>
</div>
</div>

<div id="outline-container-return-type-dao-type-single" class="outline-3">
<h3 id="return-type-dao-type-single">(:dao dao-type :single)</h3>
<div class="outline-text-3" id="text-return-type-dao-type-single">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> '* <span class="org-builtin">:from</span> 'countries <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'name <span class="org-string">"Iceland"</span>)
       (<span class="org-builtin">:dao</span> country))

#&lt;COUNTRY {1004F1BAF3}&gt;

</pre>
</div>
</div>
</div>
