doc/intro-to-s-sql.org
** Json-strs

Return a list of strings where the row returned is a json object expressed as a string
#+begin_src lisp
(query (:select 'id 'int4 'text :from 'short-data-type-tests :where (:< 'id 3)) :json-strs)
("{\"id\":1,\"int4\":2147483645,\"text\":\"text one\"}"
 "{\"id\":2,\"int4\":0,\"text\":\"text two\"}")

#+end_src

This will also handle local-time timestamps and simple-date timestamps, time-of-day and date. E.g. (with a local-time timestamp)
#+begin_src lisp
(query (:select 'timestamp-with-time-zone
        :from 'test-data
        :where (:< 'id 3))
       :json-strs)

'("{\"timestampWithTimeZone\":\"{2019-12-30T13:30:54.000000-05:00}\"}"
  "{\"timestampWithTimeZone\":\"{1919-12-30T13:30:54.000000-05:00}\"}")

#+end_src

The following is an example with a simple-date timestamp.
#+begin_src lisp
(query (:select 'timestamp-with-time-zone
        :from 'test-data
        :where (:< 'id 3)) :json-strs)
'("{\"timestampWithTimeZone\":\"2019-12-30 18:30:54:0\"}"
  "{\"timestampWithTimeZone\":\"1919-12-30 18:30:54:0\"}")

#+end_src

** Json-str

Return a single string where the row returned is a json object expressed as a string
#+begin_src lisp
(query (:select 'id 'int4 'text :from 'short-data-type-tests :where (:= 'id 3)) :json-str)
"{\"id\":3,\"int4\":3,\"text\":\"text three\"}"

#+end_src

As with :json-strs, this will also work for either simple-date or local-time timestamps
** Json-array-str

Return a string containing a json array, each element in the array is a selected row expressed as a json object. NOTE: If there is no result, this will return a string with an empty json array.
#+begin_src lisp
(query (:select 'id 'int4 'text :from 'short-data-type-tests :where (:< 'id 3)) :json-array-str)
"[{\"id\":1,\"int4\":2147483645,\"text\":\"text one\"}, {\"id\":2,\"int4\":0,\"text\":\"text two\"}]"

(query (:select 'id 'int4 'text :from 'test-data :where (:< 'id 1)) :json-array-str)
"[]"

#+end_src

As with :json-strs, this will also work for either simple-date or local-time timestamps

* As or Alias
  :PROPERTIES:
  :CUSTOM_ID: alias
  :END:
Suppose you want to return an identifier as a key with the value, but you don't want to use the column name. You can use the as keyword, or as you would expect having just seen a little s-sql, the :as keyword.
#+begin_src lisp
(first (query (:order-by
               (:select (:as 'countries.name 'countryname)
                        :from 'countries)
               'countryname )
              :alists))

((:COUNTRYNAME . "Afghanistan"))

#+end_src

You can also do this with table names.
#+begin_src lisp
(first (query (:order-by
               (:select 't1.name
                        :from (:as 'countries 't1))
               'name )
              :alists))

((:NAME . "Afghanistan"))

#+end_src

** :|| Concatenating Columns
  :PROPERTIES:
  :CUSTOM_ID: concatenate
  :END:
The concatenation operator combines two or more columns into a single column return. First, consider the query on a raw sql string:
#+begin_src lisp
(query "(SELECT countries.id, (countries.name || '-' || regions.name)
         FROM countries, regions
         WHERE ((regions.id = countries.region_id) and (countries.name = 'US')))")

((21 "US-North America"))

#+end_src

Now consider the result using s-sql.
#+begin_src lisp
(query (:select 'countries.id (:|| 'countries.name "-" 'regions.name)
                :from 'countries 'regions
                :where (:and (:= 'regions.id 'countries.region-id)
                             (:= 'countries.name "US"))))

((21 "US-North America"))

#+end_src
