doc/intro-to-s-sql.html

<div id="outline-container-org15278fc" class="outline-3">
<h3 id="org15278fc">Json-strs</h3>
<div class="outline-text-3" id="text-org15278fc">
<p>
Return a list of strings where the row returned is a json object expressed as a string
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'id 'int4 'text <span class="org-builtin">:from</span> 'short-data-type-tests <span class="org-builtin">:where</span> (<span class="org-builtin">:&lt;</span> 'id 3)) <span class="org-builtin">:json-strs</span>)
(<span class="org-string">"{\"id\":1,\"int4\":2147483645,\"text\":\"text one\"}"</span>
 <span class="org-string">"{\"id\":2,\"int4\":0,\"text\":\"text two\"}"</span>)

</pre>
</div>

<p>
This will also handle local-time timestamps and simple-date timestamps, time-of-day and date. E.g. (with a local-time timestamp)
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'timestamp-with-time-zone
        <span class="org-builtin">:from</span> 'test-data
        <span class="org-builtin">:where</span> (<span class="org-builtin">:&lt;</span> 'id 3))
       <span class="org-builtin">:json-strs</span>)

'(<span class="org-string">"{\"timestampWithTimeZone\":\"{2019-12-30T13:30:54.000000-05:00}\"}"</span>
  <span class="org-string">"{\"timestampWithTimeZone\":\"{1919-12-30T13:30:54.000000-05:00}\"}"</span>)

</pre>
</div>

<p>
The following is an example with a simple-date timestamp.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'timestamp-with-time-zone
        <span class="org-builtin">:from</span> 'test-data
        <span class="org-builtin">:where</span> (<span class="org-builtin">:&lt;</span> 'id 3)) <span class="org-builtin"><span class="org-warning">:json-strs</span></span><span class="org-warning">)</span>
'(<span class="org-string">"{\"timestampWithTimeZone\":\"2019-12-30 18:30:54:0\"}"</span>
  <span class="org-string">"{\"timestampWithTimeZone\":\"1919-12-30 18:30:54:0\"}"</span>)

</pre>
</div>
</div>
</div>

<div id="outline-container-orgf4eb7f0" class="outline-3">
<h3 id="orgf4eb7f0">Json-str</h3>
<div class="outline-text-3" id="text-orgf4eb7f0">
<p>
Return a single string where the row returned is a json object expressed as a string
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'id 'int4 'text <span class="org-builtin">:from</span> 'short-data-type-tests <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> 'id 3)) <span class="org-builtin">:json-str</span>)
<span class="org-string">"{\"id\":3,\"int4\":3,\"text\":\"text three\"}"</span>

</pre>
</div>

<p>
As with :json-strs, this will also work for either simple-date or local-time timestamps
</p>
</div>
</div>
<div id="outline-container-org03deb44" class="outline-3">
<h3 id="org03deb44">Json-array-str</h3>
<div class="outline-text-3" id="text-org03deb44">
<p>
Return a string containing a json array, each element in the array is a selected row expressed as a json object. NOTE: If there is no result, this will return a string with an empty json array.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'id 'int4 'text <span class="org-builtin">:from</span> 'short-data-type-tests <span class="org-builtin">:where</span> (<span class="org-builtin">:&lt;</span> 'id 3)) <span class="org-builtin">:json-array-str</span>)
<span class="org-string">"[{\"id\":1,\"int4\":2147483645,\"text\":\"text one\"}, {\"id\":2,\"int4\":0,\"text\":\"text two\"}]"</span>

(query (<span class="org-builtin">:select</span> 'id 'int4 'text <span class="org-builtin">:from</span> 'test-data <span class="org-builtin">:where</span> (<span class="org-builtin">:&lt;</span> 'id 1)) <span class="org-builtin">:json-array-str</span>)
<span class="org-string">"[]"</span>

</pre>
</div>

<p>
As with :json-strs, this will also work for either simple-date or local-time timestamps
</p>
</div>
</div>
</div>

<div id="outline-container-alias" class="outline-2">
<h2 id="alias">As or Alias</h2>
<div class="outline-text-2" id="text-alias">
<p>
Suppose you want to return an identifier as a key with the value, but you don't want to use the column name. You can use the as keyword, or as you would expect having just seen a little s-sql, the :as keyword.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(first (query (<span class="org-builtin">:order-by</span>
               (<span class="org-builtin">:select</span> (<span class="org-builtin">:as</span> 'countries.name 'countryname)
                        <span class="org-builtin">:from</span> 'countries)
               'countryname )
              <span class="org-builtin">:alists</span>))

((<span class="org-builtin">:COUNTRYNAME</span> . <span class="org-string">"Afghanistan"</span>))

</pre>
</div>

<p>
You can also do this with table names.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(first (query (<span class="org-builtin">:order-by</span>
               (<span class="org-builtin">:select</span> 't1.name
                        <span class="org-builtin">:from</span> (<span class="org-builtin">:as</span> 'countries 't1))
               'name )
              <span class="org-builtin">:alists</span>))

((<span class="org-builtin">:NAME</span> . <span class="org-string">"Afghanistan"</span>))

</pre>
</div>
</div>

<div id="outline-container-concatenate" class="outline-3">
<h3 id="concatenate">:|| Concatenating Columns</h3>
<div class="outline-text-3" id="text-concatenate">
<p>
The concatenation operator combines two or more columns into a single column return. First, consider the query on a raw sql string:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query <span class="org-string">"(SELECT countries.id, (countries.name || '-' || regions.name)</span>
<span class="org-string">         FROM countries, regions</span>
<span class="org-string">         WHERE ((regions.id = countries.region_id) and (countries.name = 'US')))"</span>)

((21 <span class="org-string">"US-North America"</span>))

</pre>
</div>

<p>
Now consider the result using s-sql.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'countries.id (:|| 'countries.name <span class="org-string">"-"</span> 'regions.name)
                <span class="org-builtin">:from</span> 'countries 'regions
                <span class="org-builtin">:where</span> (<span class="org-builtin">:and</span> (<span class="org-builtin">:=</span> 'regions.id 'countries.region-id)
                             (<span class="org-builtin">:=</span> 'countries.name <span class="org-string">"US"</span>))))

((21 <span class="org-string">"US-North America"</span>))

</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>